export default [
  {
    'name': '北京',
    'children': [
      {
        'name': '北京市',
        'children': [
          '东城区',
          '西城区',
          '朝阳区',
          '丰台区',
          '海淀区',
          '昌平区',
          '通州区',
          '石景山区',
          '延庆县',
          '房山区',
          '顺义区',
          '怀柔区',
          '大兴区',
          '平谷区',
          '门头沟区',
          '密云县'
        ]
      }
    ]
  },
  {
    'name': '天津',
    'children': [
      {
        'name': '天津市',
        'children': [
          '静海县',
          '西青区',
          '滨海新区',
          '津南区',
          '北辰区',
          '红桥区',
          '宁河县',
          '河北区',
          '河东区',
          '宝坻区',
          '蓟县',
          '东丽区',
          '南开区',
          '和平区',
          '河西区',
          '武清区'
        ]
      }
    ]
  },
  {
    'name': '内蒙古',
    'children': [
      {
        'name': '呼伦贝尔市',
        'children': [
          '扎兰屯市',
          '鄂温克族自治旗',
          '阿荣旗',
          '根河市',
          '牙克石市',
          '扎赉诺尔区',
          '莫力达瓦达斡尔族自治旗',
          '海拉尔区',
          '满洲里市',
          '新巴尔虎右旗',
          '陈巴尔虎旗',
          '鄂伦春自治旗',
          '额尔古纳市',
          '新巴尔虎左旗'
        ]
      },
      {
        'name': '锡林郭勒盟',
        'children': [
          '正镶白旗',
          '多伦县',
          '西乌珠穆沁旗',
          '锡林浩特市',
          '东乌珠穆沁旗',
          '镶黄旗',
          '二连浩特市',
          '苏尼特左旗',
          '正蓝旗',
          '苏尼特右旗',
          '阿巴嘎旗',
          '太仆寺旗'
        ]
      },
      {
        'name': '包头市',
        'children': [
          '达尔罕茂明安联合旗',
          '青山区',
          '东河区',
          '固阳县',
          '白云鄂博矿区',
          '九原区',
          '昆都仑区',
          '土默特右旗',
          '石拐区'
        ]
      },
      {
        'name': '阿拉善盟',
        'children': [
          '阿拉善右旗',
          '阿拉善左旗',
          '额济纳旗'
        ]
      },
      {
        'name': '呼和浩特市',
        'children': [
          '土默特左旗',
          '清水河县',
          '新城区',
          '和林格尔县',
          '托克托县',
          '回民区',
          '武川县',
          '赛罕区',
          '玉泉区'
        ]
      },
      {
        'name': '兴安盟',
        'children': [
          '突泉县',
          '乌兰浩特市',
          '科尔沁右翼中旗',
          '阿尔山市',
          '扎赉特旗',
          '科尔沁右翼前旗'
        ]
      },
      {
        'name': '乌兰察布市',
        'children': [
          '集宁区',
          '察哈尔右翼前旗',
          '化德县',
          '丰镇市',
          '察哈尔右翼后旗',
          '察哈尔右翼中旗',
          '卓资县',
          '兴和县',
          '商都县',
          '凉城县',
          '四子王旗'
        ]
      },
      {
        'name': '巴彦淖尔市',
        'children': [
          '临河区',
          '五原县',
          '乌拉特中旗',
          '杭锦后旗',
          '乌拉特后旗',
          '磴口县',
          '乌拉特前旗'
        ]
      },
      {
        'name': '通辽市',
        'children': [
          '霍林郭勒市',
          '科尔沁左翼后旗',
          '库伦旗',
          '科尔沁左翼中旗',
          '科尔沁区',
          '开鲁县',
          '扎鲁特旗',
          '奈曼旗'
        ]
      },
      {
        'name': '鄂尔多斯市',
        'children': [
          '乌审旗',
          '杭锦旗',
          '东胜区',
          '鄂托克前旗',
          '鄂托克旗',
          '伊金霍洛旗',
          '达拉特旗',
          '准格尔旗'
        ]
      },
      {
        'name': '乌海市',
        'children': [
          '海南区',
          '海勃湾区',
          '乌达区'
        ]
      },
      {
        'name': '赤峰市',
        'children': [
          '阿鲁科尔沁旗',
          '宁城县',
          '林西县',
          '喀喇沁旗',
          '巴林右旗',
          '元宝山区',
          '巴林左旗',
          '松山区',
          '红山区',
          '翁牛特旗',
          '克什克腾旗',
          '敖汉旗'
        ]
      }
    ]
  },
  {
    'name': '河北',
    'children': [
      {
        'name': '石家庄市',
        'children': [
          '赞皇县',
          '井陉矿区',
          '赵县',
          '正定县',
          '鹿泉市',
          '元氏县',
          '桥东区',
          '新乐市',
          '藁城市',
          '灵寿县',
          '辛集市',
          '新华区',
          '裕华区',
          '行唐县',
          '高邑县',
          '栾城县',
          '平山县',
          '长安区',
          '桥西区',
          '晋州市',
          '无极县',
          '井陉县',
          '深泽县'
        ]
      },
      {
        'name': '张家口市',
        'children': [
          '宣化县',
          '万全县',
          '怀来县',
          '下花园区',
          '桥东区',
          '怀安县',
          '蔚县',
          '桥西区',
          '阳原县',
          '康保县',
          '张北县',
          '尚义县',
          '赤城县',
          '崇礼县',
          '沽源县',
          '涿鹿县',
          '宣化区'
        ]
      },
      {
        'name': '邯郸市',
        'children': [
          '涉县',
          '复兴区',
          '峰峰矿区',
          '成安县',
          '大名县',
          '馆陶县',
          '鸡泽县',
          '永年县',
          '丛台区',
          '肥乡县',
          '邯山区',
          '邯郸县',
          '广平县',
          '武安市',
          '魏县',
          '临漳县',
          '磁县',
          '邱县',
          '曲周县'
        ]
      },
      {
        'name': '唐山市',
        'children': [
          '迁安市',
          '滦南县',
          '古冶区',
          '曹妃甸区',
          '玉田县',
          '路南区',
          '路北区',
          '迁西县',
          '丰南区',
          '滦县',
          '开平区',
          '丰润区',
          '遵化市',
          '乐亭县'
        ]
      },
      {
        'name': '秦皇岛市',
        'children': [
          '昌黎县',
          '海港区',
          '山海关区',
          '卢龙县',
          '青龙满族自治县',
          '北戴河区',
          '抚宁县'
        ]
      },
      {
        'name': '廊坊市',
        'children': [
          '霸州市',
          '香河县',
          '固安县',
          '广阳区',
          '大厂回族自治县',
          '文安县',
          '永清县',
          '三河市',
          '大城县',
          '安次区'
        ]
      },
      {
        'name': '衡水市',
        'children': [
          '冀州市',
          '枣强县',
          '故城县',
          '阜城县',
          '深州市',
          '景县',
          '武强县',
          '武邑县',
          '饶阳县',
          '桃城区',
          '安平县'
        ]
      },
      {
        'name': '承德市',
        'children': [
          '丰宁满族自治县',
          '滦平县',
          '围场满族蒙古族自治县',
          '隆化县',
          '宽城满族自治县',
          '双滦区',
          '鹰手营子矿区',
          '平泉县',
          '兴隆县',
          '承德县',
          '双桥区'
        ]
      },
      {
        'name': '邢台市',
        'children': [
          '清河县',
          '临西县',
          '柏乡县',
          '南宫市',
          '沙河市',
          '新河县',
          '任县',
          '内丘县',
          '威县',
          '桥东区',
          '巨鹿县',
          '广宗县',
          '邢台县',
          '南和县',
          '平乡县',
          '宁晋县',
          '桥西区',
          '临城县',
          '隆尧县'
        ]
      },
      {
        'name': '沧州市',
        'children': [
          '吴桥县',
          '东光县',
          '孟村回族自治县',
          '海兴县',
          '河间市',
          '肃宁县',
          '沧县',
          '新华区',
          '黄骅市',
          '盐山县',
          '泊头市',
          '献县',
          '任丘市',
          '运河区',
          '青县',
          '南皮县'
        ]
      },
      {
        'name': '保定市',
        'children': [
          '曲阳县',
          '安新县',
          '雄县',
          '南市区',
          '唐县',
          '高阳县',
          '望都县',
          '满城县',
          '容城县',
          '高碑店市',
          '北市区',
          '蠡县',
          '易县',
          '徐水县',
          '清苑县',
          '博野县',
          '顺平县',
          '阜平县',
          '涿州市',
          '定兴县',
          '涞源县',
          '新市区',
          '涞水县',
          '定州市',
          '安国市'
        ]
      }
    ]
  },
  {
    'name': '上海',
    'children': [
      {
        'name': '上海市',
        'children': [
          '金山区',
          '崇明县',
          '奉贤区',
          '宝山区',
          '杨浦区',
          '闸北区',
          '普陀区',
          '松江区',
          '青浦区',
          '黄浦区',
          '浦东新区',
          '静安区',
          '长宁区',
          '虹口区',
          '嘉定区',
          '徐汇区',
          '闵行区'
        ]
      }
    ]
  },
  {
    'name': '浙江',
    'children': [
      {
        'name': '舟山市',
        'children': [
          '嵊泗县',
          '岱山县',
          '定海区',
          '普陀区'
        ]
      },
      {
        'name': '绍兴市',
        'children': [
          '诸暨市',
          '上虞市',
          '嵊州市',
          '越城区',
          '绍兴县',
          '新昌县'
        ]
      },
      {
        'name': '衢州市',
        'children': [
          '柯城区',
          '衢江区',
          '龙游县',
          '常山县',
          '江山市',
          '开化县'
        ]
      },
      {
        'name': '丽水市',
        'children': [
          '莲都区',
          '景宁畲族自治县',
          '遂昌县',
          '云和县',
          '青田县',
          '庆元县',
          '缙云县',
          '龙泉市',
          '松阳县'
        ]
      },
      {
        'name': '台州市',
        'children': [
          '三门县',
          '椒江区',
          '玉环县',
          '仙居县',
          '路桥区',
          '温岭市',
          '黄岩区',
          '临海市',
          '天台县'
        ]
      },
      {
        'name': '温州市',
        'children': [
          '文成县',
          '平阳县',
          '鹿城区',
          '瑞安市',
          '永嘉县',
          '洞头县',
          '瓯海区',
          '苍南县',
          '龙湾区',
          '乐清市',
          '泰顺县'
        ]
      },
      {
        'name': '嘉兴市',
        'children': [
          '南湖区',
          '海盐县',
          '嘉善县',
          '平湖市',
          '桐乡市',
          '海宁市',
          '秀洲区'
        ]
      },
      {
        'name': '宁波市',
        'children': [
          '宁海县',
          '江北区',
          '海曙区',
          '江东区',
          '奉化市',
          '鄞州区',
          '慈溪市',
          '北仑区',
          '余姚市',
          '镇海区',
          '象山县'
        ]
      },
      {
        'name': '金华市',
        'children': [
          '义乌市',
          '永康市',
          '婺城区',
          '浦江县',
          '兰溪市',
          '东阳市',
          '金东区',
          '武义县',
          '磐安县'
        ]
      },
      {
        'name': '湖州市',
        'children': [
          '南浔区',
          '长兴县',
          '吴兴区',
          '德清县',
          '安吉县'
        ]
      },
      {
        'name': '杭州市',
        'children': [
          '上城区',
          '西湖区',
          '江干区',
          '建德市',
          '拱墅区',
          '下城区',
          '淳安县',
          '桐庐县',
          '富阳市',
          '萧山区',
          '余杭区',
          '临安市',
          '滨江区'
        ]
      }
    ]
  },
  {
    'name': '重庆',
    'children': [
      {
        'name': '重庆市',
        'children': [
          '巫山县',
          '綦江区',
          '北碚区',
          '渝中区',
          '石柱土家族自治县',
          '荣昌县',
          '铜梁县',
          '巫溪县',
          '奉节县',
          '璧山县',
          '开县',
          '酉阳土家族苗族自治县',
          '渝北区',
          '云阳县',
          '永川区',
          '秀山土家族苗族自治县',
          '忠县',
          '江北区',
          '武隆县',
          '江津区',
          '大足区',
          '潼南县',
          '彭水苗族土家族自治县',
          '丰都县',
          '沙坪坝区',
          '大渡口区',
          '万州区',
          '九龙坡区',
          '巴南区',
          '垫江县',
          '南岸区',
          '合川区',
          '长寿区',
          '涪陵区',
          '黔江区',
          '南川区',
          '梁平县',
          '城口县'
        ]
      }
    ]
  },
  {
    'name': '江西',
    'children': [
      {
        'name': '抚州市',
        'children': [
          '南丰县',
          '南城县',
          '临川区',
          '黎川县',
          '东乡县',
          '金溪县',
          '宜黄县',
          '崇仁县',
          '乐安县',
          '资溪县',
          '广昌县'
        ]
      },
      {
        'name': '吉安市',
        'children': [
          '青原区',
          '新干县',
          '峡江县',
          '万安县',
          '吉州区',
          '吉安县',
          '井冈山市',
          '遂川县',
          '吉水县',
          '泰和县',
          '永新县',
          '永丰县',
          '安福县'
        ]
      },
      {
        'name': '萍乡市',
        'children': [
          '安源区',
          '湘东区',
          '上栗县',
          '芦溪县',
          '莲花县'
        ]
      },
      {
        'name': '赣州市',
        'children': [
          '上犹县',
          '大余县',
          '瑞金市',
          '安远县',
          '宁都县',
          '赣县',
          '信丰县',
          '龙南县',
          '南康市',
          '寻乌县',
          '会昌县',
          '全南县',
          '石城县',
          '于都县',
          '崇义县',
          '章贡区',
          '定南县',
          '兴国县'
        ]
      },
      {
        'name': '鹰潭市',
        'children': [
          '贵溪市',
          '余江县',
          '市辖区',
          '月湖区'
        ]
      },
      {
        'name': '南昌市',
        'children': [
          '青山湖区',
          '东湖区',
          '青云谱区',
          '新建县',
          '安义县',
          '西湖区',
          '南昌县',
          '进贤县',
          '湾里区'
        ]
      },
      {
        'name': '新余市',
        'children': [
          '分宜县',
          '渝水区'
        ]
      },
      {
        'name': '宜春市',
        'children': [
          '铜鼓县',
          '宜丰县',
          '丰城市',
          '樟树市',
          '奉新县',
          '上高县',
          '靖安县',
          '高安市',
          '万载县',
          '袁州区'
        ]
      },
      {
        'name': '九江市',
        'children': [
          '庐山区',
          '武宁县',
          '浔阳区',
          '修水县',
          '九江县',
          '德安县',
          '都昌县',
          '湖口县',
          '共青城市',
          '星子县',
          '永修县',
          '彭泽县',
          '瑞昌市'
        ]
      },
      {
        'name': '上饶市',
        'children': [
          '广丰县',
          '玉山县',
          '鄱阳县',
          '德兴市',
          '横峰县',
          '万年县',
          '余干县',
          '弋阳县',
          '婺源县',
          '铅山县',
          '信州区',
          '上饶县'
        ]
      },
      {
        'name': '景德镇市',
        'children': [
          '浮梁县',
          '昌江区',
          '乐平市',
          '珠山区'
        ]
      }
    ]
  },
  {
    'name': '江苏',
    'children': [
      {
        'name': '南通市',
        'children': [
          '海门市',
          '如东县',
          '海安县',
          '如皋市',
          '通州区',
          '崇川区',
          '港闸区',
          '启东市'
        ]
      },
      {
        'name': '镇江市',
        'children': [
          '句容市',
          '扬中市',
          '京口区',
          '润州区',
          '丹阳市',
          '丹徒区'
        ]
      },
      {
        'name': '盐城市',
        'children': [
          '大丰市',
          '射阳县',
          '建湖县',
          '盐都区',
          '东台市',
          '响水县',
          '阜宁县',
          '亭湖区',
          '滨海县'
        ]
      },
      {
        'name': '苏州市',
        'children': [
          '吴中区',
          '虎丘区',
          '相城区',
          '太仓市',
          '姑苏区',
          '常熟市',
          '张家港市',
          '吴江区',
          '昆山市'
        ]
      },
      {
        'name': '淮安市',
        'children': [
          '洪泽县',
          '金湖县',
          '清河区',
          '盱眙县',
          '清浦区',
          '淮阴区',
          '涟水县',
          '淮安区'
        ]
      },
      {
        'name': '连云港市',
        'children': [
          '连云区',
          '新浦区',
          '东海县',
          '海州区',
          '灌云县',
          '灌南县',
          '赣榆县'
        ]
      },
      {
        'name': '徐州市',
        'children': [
          '睢宁县',
          '新沂市',
          '邳州市',
          '鼓楼区',
          '铜山区',
          '云龙区',
          '丰县',
          '泉山区',
          '贾汪区',
          '沛县'
        ]
      },
      {
        'name': '扬州市',
        'children': [
          '广陵区',
          '仪征市',
          '江都区',
          '高邮市',
          '邗江区',
          '宝应县'
        ]
      },
      {
        'name': '常州市',
        'children': [
          '金坛市',
          '戚墅堰区',
          '天宁区',
          '武进区',
          '新北区',
          '溧阳市',
          '钟楼区'
        ]
      },
      {
        'name': '无锡市',
        'children': [
          '滨湖区',
          '惠山区',
          '锡山区',
          '宜兴市',
          '江阴市',
          '南长区',
          '北塘区',
          '崇安区'
        ]
      },
      {
        'name': '宿迁市',
        'children': [
          '宿豫区',
          '宿城区',
          '泗阳县',
          '泗洪县',
          '沭阳县'
        ]
      },
      {
        'name': '南京市',
        'children': [
          '栖霞区',
          '建邺区',
          '溧水区',
          '江宁区',
          '秦淮区',
          '高淳区',
          '浦口区',
          '六合区',
          '玄武区',
          '雨花台区',
          '鼓楼区'
        ]
      },
      {
        'name': '泰州市',
        'children': [
          '靖江市',
          '海陵区',
          '泰兴市',
          '市辖区',
          '姜堰区',
          '兴化市',
          '高港区'
        ]
      }
    ]
  },
  {
    'name': '陕西',
    'children': [
      {
        'name': '渭南市',
        'children': [
          '潼关县',
          '白水县',
          '韩城市',
          '蒲城县',
          '华县',
          '富平县',
          '大荔县',
          '澄城县',
          '临渭区',
          '合阳县',
          '华阴市'
        ]
      },
      {
        'name': '榆林市',
        'children': [
          '定边县',
          '神木县',
          '吴堡县',
          '米脂县',
          '清涧县',
          '靖边县',
          '子洲县',
          '绥德县',
          '佳县',
          '府谷县',
          '榆阳区',
          '横山县'
        ]
      },
      {
        'name': '汉中市',
        'children': [
          '宁强县',
          '城固县',
          '南郑县',
          '洋县',
          '佛坪县',
          '略阳县',
          '留坝县',
          '汉台区',
          '西乡县',
          '勉县',
          '镇巴县'
        ]
      },
      {
        'name': '咸阳市',
        'children': [
          '礼泉县',
          '泾阳县',
          '乾县',
          '兴平市',
          '永寿县',
          '杨陵区',
          '三原县',
          '长武县',
          '渭城区',
          '彬县',
          '秦都区',
          '旬邑县',
          '淳化县',
          '武功县'
        ]
      },
      {
        'name': '宝鸡市',
        'children': [
          '眉县',
          '太白县',
          '千阳县',
          '岐山县',
          '陇县',
          '凤翔县',
          '陈仓区',
          '扶风县',
          '渭滨区',
          '金台区',
          '麟游县',
          '凤县'
        ]
      },
      {
        'name': '安康市',
        'children': [
          '紫阳县',
          '宁陕县',
          '平利县',
          '白河县',
          '汉阴县',
          '石泉县',
          '汉滨区',
          '旬阳县',
          '岚皋县',
          '镇坪县'
        ]
      },
      {
        'name': '西安市',
        'children': [
          '长安区',
          '蓝田县',
          '临潼区',
          '莲湖区',
          '碑林区',
          '周至县',
          '阎良区',
          '高陵县',
          '灞桥区',
          '户县',
          '未央区',
          '新城区',
          '雁塔区'
        ]
      },
      {
        'name': '商洛市',
        'children': [
          '柞水县',
          '丹凤县',
          '山阳县',
          '商州区',
          '商南县',
          '洛南县',
          '镇安县'
        ]
      },
      {
        'name': '铜川市',
        'children': [
          '印台区',
          '宜君县',
          '王益区',
          '耀州区'
        ]
      },
      {
        'name': '延安市',
        'children': [
          '洛川县',
          '富县',
          '延川县',
          '安塞县',
          '宜川县',
          '黄陵县',
          '黄龙县',
          '甘泉县',
          '志丹县',
          '宝塔区',
          '吴起县',
          '子长县',
          '延长县'
        ]
      }
    ]
  },
  {
    'name': '福建',
    'children': [
      {
        'name': '三明市',
        'children': [
          '宁化县',
          '将乐县',
          '建宁县',
          '尤溪县',
          '三元区',
          '明溪县',
          '清流县',
          '泰宁县',
          '大田县',
          '沙县',
          '永安市',
          '梅列区'
        ]
      },
      {
        'name': '漳州市',
        'children': [
          '长泰县',
          '龙文区',
          '平和县',
          '漳浦县',
          '华安县',
          '龙海市',
          '芗城区',
          '诏安县',
          '东山县',
          '云霄县',
          '南靖县'
        ]
      },
      {
        'name': '厦门市',
        'children': [
          '翔安区',
          '海沧区',
          '集美区',
          '湖里区',
          '同安区',
          '思明区'
        ]
      },
      {
        'name': '宁德市',
        'children': [
          '霞浦县',
          '柘荣县',
          '蕉城区',
          '古田县',
          '周宁县',
          '寿宁县',
          '福安市',
          '福鼎市',
          '屏南县'
        ]
      },
      {
        'name': '福州市',
        'children': [
          '长乐市',
          '台江区',
          '连江县',
          '闽侯县',
          '永泰县',
          '鼓楼区',
          '平潭县',
          '福清市',
          '仓山区',
          '晋安区',
          '马尾区',
          '罗源县',
          '闽清县'
        ]
      },
      {
        'name': '南平市',
        'children': [
          '延平区',
          '邵武市',
          '顺昌县',
          '政和县',
          '光泽县',
          '浦城县',
          '武夷山市',
          '建瓯市',
          '松溪县',
          '建阳市'
        ]
      },
      {
        'name': '莆田市',
        'children': [
          '荔城区',
          '仙游县',
          '秀屿区',
          '城厢区',
          '涵江区'
        ]
      },
      {
        'name': '泉州市',
        'children': [
          '安溪县',
          '石狮市',
          '德化县',
          '惠安县',
          '永春县',
          '泉港区',
          '南安市',
          '晋江市',
          '洛江区',
          '金门县',
          '鲤城区',
          '丰泽区'
        ]
      },
      {
        'name': '龙岩市',
        'children': [
          '武平县',
          '永定县',
          '连城县',
          '上杭县',
          '新罗区',
          '长汀县',
          '漳平市'
        ]
      }
    ]
  },
  {
    'name': '河南',
    'children': [
      {
        'name': '鹤壁市',
        'children': [
          '鹤山区',
          '淇县',
          '淇滨区',
          '浚县',
          '山城区'
        ]
      },
      {
        'name': '郑州市',
        'children': [
          '二七区',
          '新郑市',
          '上街区',
          '中原区',
          '登封市',
          '中牟县',
          '惠济区',
          '荥阳市',
          '新密市',
          '管城回族区',
          '巩义市',
          '金水区'
        ]
      },
      {
        'name': '南阳市',
        'children': [
          '内乡县',
          '唐河县',
          '南召县',
          '西峡县',
          '桐柏县',
          '宛城区',
          '卧龙区',
          '邓州市',
          '方城县',
          '淅川县',
          '镇平县',
          '社旗县',
          '新野县'
        ]
      },
      {
        'name': '新乡市',
        'children': [
          '长垣县',
          '获嘉县',
          '牧野区',
          '辉县市',
          '延津县',
          '新乡县',
          '原阳县',
          '凤泉区',
          '红旗区',
          '卫滨区',
          '封丘县',
          '卫辉市'
        ]
      },
      {
        'name': '许昌市',
        'children': [
          '鄢陵县',
          '长葛市',
          '禹州市',
          '许昌县',
          '襄城县',
          '魏都区'
        ]
      },
      {
        'name': '商丘市',
        'children': [
          '柘城县',
          '宁陵县',
          '虞城县',
          '民权县',
          '睢县',
          '夏邑县',
          '梁园区',
          '永城市',
          '睢阳区'
        ]
      },
      {
        'name': '周口市',
        'children': [
          '沈丘县',
          '西华县',
          '扶沟县',
          '鹿邑县',
          '郸城县',
          '商水县',
          '项城市',
          '川汇区',
          '淮阳县',
          '太康县'
        ]
      },
      {
        'name': '信阳市',
        'children': [
          '光山县',
          '固始县',
          '新县',
          '平桥区',
          '息县',
          '潢川县',
          '浉河区',
          '罗山县',
          '淮滨县',
          '商城县'
        ]
      },
      {
        'name': '漯河市',
        'children': [
          '召陵区',
          '源汇区',
          '舞阳县',
          '市辖区',
          '临颍县',
          '郾城区'
        ]
      },
      {
        'name': '濮阳市',
        'children': [
          '范县',
          '濮阳县',
          '华龙区',
          '清丰县',
          '南乐县',
          '台前县'
        ]
      },
      {
        'name': '驻马店市',
        'children': [
          '西平县',
          '遂平县',
          '泌阳县',
          '平舆县',
          '确山县',
          '上蔡县',
          '新蔡县',
          '正阳县',
          '汝南县',
          '驿城区'
        ]
      },
      {
        'name': '洛阳市',
        'children': [
          '吉利区',
          '伊川县',
          '栾川县',
          '宜阳县',
          '汝阳县',
          '嵩县',
          '洛宁县',
          '洛龙区',
          '新安县',
          '偃师市',
          '西工区',
          '老城区',
          '瀍河回族区',
          '涧西区',
          '孟津县'
        ]
      },
      {
        'name': '济源市'
      },
      {
        'name': '焦作市',
        'children': [
          '孟州市',
          '解放区',
          '马村区',
          '中站区',
          '温县',
          '博爱县',
          '山阳区',
          '修武县',
          '沁阳市',
          '武陟县'
        ]
      },
      {
        'name': '平顶山市',
        'children': [
          '舞钢市',
          '宝丰县',
          '湛河区',
          '叶县',
          '郏县',
          '新华区',
          '鲁山县',
          '石龙区',
          '汝州市',
          '卫东区'
        ]
      },
      {
        'name': '开封市',
        'children': [
          '通许县',
          '杞县',
          '兰考县',
          '禹王台区',
          '金明区',
          '顺河回族区',
          '龙亭区',
          '尉氏县',
          '鼓楼区',
          '开封县'
        ]
      },
      {
        'name': '三门峡市',
        'children': [
          '陕县',
          '灵宝市',
          '湖滨区',
          '渑池县',
          '卢氏县',
          '义马市'
        ]
      },
      {
        'name': '安阳市',
        'children': [
          '汤阴县',
          '龙安区',
          '林州市',
          '安阳县',
          '北关区',
          '内黄县',
          '文峰区',
          '滑县',
          '殷都区'
        ]
      }
    ]
  },
  {
    'name': '安徽',
    'children': [
      {
        'name': '安庆市',
        'children': [
          '宿松县',
          '大观区',
          '太湖县',
          '桐城市',
          '宜秀区',
          '岳西县',
          '迎江区',
          '枞阳县',
          '怀宁县',
          '望江县',
          '潜山县'
        ]
      },
      {
        'name': '滁州市',
        'children': [
          '明光市',
          '来安县',
          '全椒县',
          '天长市',
          '凤阳县',
          '南谯区',
          '定远县',
          '琅琊区'
        ]
      },
      {
        'name': '马鞍山市',
        'children': [
          '含山县',
          '和县',
          '当涂县',
          '博望区',
          '花山区',
          '雨山区'
        ]
      },
      {
        'name': '黄山市',
        'children': [
          '屯溪区',
          '休宁县',
          '祁门县',
          '黟县',
          '徽州区',
          '黄山区',
          '歙县'
        ]
      },
      {
        'name': '宣城市',
        'children': [
          '宁国市',
          '广德县',
          '宣州区',
          '泾县',
          '旌德县',
          '郎溪县',
          '绩溪县'
        ]
      },
      {
        'name': '阜阳市',
        'children': [
          '颍上县',
          '临泉县',
          '阜南县',
          '颍东区',
          '界首市',
          '颍州区',
          '颍泉区',
          '太和县'
        ]
      },
      {
        'name': '池州市',
        'children': [
          '东至县',
          '贵池区',
          '石台县',
          '青阳县'
        ]
      },
      {
        'name': '合肥市',
        'children': [
          '蜀山区',
          '瑶海区',
          '肥东县',
          '肥西县',
          '包河区',
          '长丰县',
          '庐阳区',
          '巢湖市',
          '庐江县'
        ]
      },
      {
        'name': '六安市',
        'children': [
          '霍山县',
          '舒城县',
          '寿县',
          '金寨县',
          '裕安区',
          '金安区',
          '霍邱县'
        ]
      },
      {
        'name': '蚌埠市',
        'children': [
          '怀远县',
          '禹会区',
          '五河县',
          '淮上区',
          '固镇县',
          '龙子湖区',
          '蚌山区'
        ]
      },
      {
        'name': '宿州市',
        'children': [
          '埇桥区',
          '萧县',
          '砀山县',
          '泗县',
          '市辖区',
          '灵璧县'
        ]
      },
      {
        'name': '亳州市',
        'children': [
          '谯城区',
          '蒙城县',
          '利辛县',
          '涡阳县'
        ]
      },
      {
        'name': '淮南市',
        'children': [
          '凤台县',
          '八公山区',
          '田家庵区',
          '谢家集区',
          '潘集区',
          '大通区'
        ]
      },
      {
        'name': '芜湖市',
        'children': [
          '芜湖县',
          '弋江区',
          '镜湖区',
          '南陵县',
          '无为县',
          '繁昌县',
          '鸠江区',
          '三山区'
        ]
      },
      {
        'name': '铜陵市',
        'children': [
          '狮子山区',
          '铜陵县',
          '铜官山区',
          '郊区'
        ]
      },
      {
        'name': '淮北市',
        'children': [
          '相山区',
          '烈山区',
          '濉溪县',
          '杜集区'
        ]
      }
    ]
  },
  {
    'name': '青海',
    'children': [
      {
        'name': '西宁市',
        'children': [
          '城北区',
          '湟中县',
          '城西区',
          '城中区',
          '城东区',
          '大通回族土族自治县',
          '湟源县'
        ]
      },
      {
        'name': '玉树藏族自治州',
        'children': [
          '称多县',
          '玉树市',
          '囊谦县',
          '杂多县',
          '曲麻莱县',
          '治多县'
        ]
      },
      {
        'name': '海北藏族自治州',
        'children': [
          '门源回族自治县',
          '海晏县',
          '祁连县',
          '刚察县'
        ]
      },
      {
        'name': '果洛藏族自治州',
        'children': [
          '班玛县',
          '达日县',
          '甘德县',
          '玛多县',
          '久治县',
          '玛沁县'
        ]
      },
      {
        'name': '海东市',
        'children': [
          '互助土族自治县',
          '乐都区',
          '平安县',
          '民和回族土族自治县',
          '循化撒拉族自治县',
          '化隆回族自治县'
        ]
      },
      {
        'name': '海南藏族自治州',
        'children': [
          '贵南县',
          '同德县',
          '共和县',
          '贵德县',
          '兴海县'
        ]
      },
      {
        'name': '黄南藏族自治州',
        'children': [
          '河南蒙古族自治县',
          '泽库县',
          '同仁县',
          '尖扎县'
        ]
      },
      {
        'name': '海西蒙古族藏族自治州',
        'children': [
          '乌兰县',
          '天峻县',
          '格尔木市',
          '德令哈市',
          '都兰县'
        ]
      }
    ]
  },
  {
    'name': '云南',
    'children': [
      {
        'name': '大理白族自治州',
        'children': [
          '宾川县',
          '鹤庆县',
          '弥渡县',
          '南涧彝族自治县',
          '大理市',
          '漾濞彝族自治县',
          '洱源县',
          '祥云县',
          '剑川县',
          '云龙县',
          '永平县',
          '巍山彝族回族自治县'
        ]
      },
      {
        'name': '玉溪市',
        'children': [
          '江川县',
          '澄江县',
          '通海县',
          '元江哈尼族彝族傣族自治县',
          '华宁县',
          '新平彝族傣族自治县',
          '峨山彝族自治县',
          '易门县',
          '红塔区'
        ]
      },
      {
        'name': '怒江傈僳族自治州',
        'children': [
          '福贡县',
          '兰坪白族普米族自治县',
          '泸水县',
          '贡山独龙族怒族自治县'
        ]
      },
      {
        'name': '曲靖市',
        'children': [
          '马龙县',
          '富源县',
          '陆良县',
          '师宗县',
          '罗平县',
          '会泽县',
          '宣威市',
          '麒麟区',
          '沾益县'
        ]
      },
      {
        'name': '西双版纳傣族自治州',
        'children': [
          '勐腊县',
          '景洪市',
          '勐海县'
        ]
      },
      {
        'name': '迪庆藏族自治州',
        'children': [
          '维西傈僳族自治县',
          '德钦县',
          '香格里拉县'
        ]
      },
      {
        'name': '红河哈尼族彝族自治州',
        'children': [
          '泸西县',
          '金平苗族瑶族傣族自治县',
          '绿春县',
          '建水县',
          '弥勒市',
          '蒙自市',
          '屏边苗族自治县',
          '红河县',
          '石屏县',
          '元阳县',
          '开远市',
          '河口瑶族自治县',
          '个旧市'
        ]
      },
      {
        'name': '文山壮族苗族自治州',
        'children': [
          '麻栗坡县',
          '丘北县',
          '文山市',
          '西畴县',
          '广南县',
          '砚山县',
          '富宁县',
          '马关县'
        ]
      },
      {
        'name': '德宏傣族景颇族自治州',
        'children': [
          '梁河县',
          '陇川县',
          '瑞丽市',
          '盈江县',
          '芒市'
        ]
      },
      {
        'name': '丽江市',
        'children': [
          '永胜县',
          '古城区',
          '玉龙纳西族自治县',
          '宁蒗彝族自治县',
          '华坪县'
        ]
      },
      {
        'name': '临沧市',
        'children': [
          '沧源佤族自治县',
          '临翔区',
          '双江拉祜族佤族布朗族傣族自治县',
          '云县',
          '凤庆县',
          '镇康县',
          '耿马傣族佤族自治县',
          '永德县'
        ]
      },
      {
        'name': '昭通市',
        'children': [
          '威信县',
          '镇雄县',
          '大关县',
          '绥江县',
          '水富县',
          '昭阳区',
          '彝良县',
          '鲁甸县',
          '永善县',
          '巧家县',
          '盐津县'
        ]
      },
      {
        'name': '普洱市',
        'children': [
          '墨江哈尼族自治县',
          '西盟佤族自治县',
          '镇沅彝族哈尼族拉祜族自治县',
          '宁洱哈尼族彝族自治县',
          '景谷傣族彝族自治县',
          '孟连傣族拉祜族佤族自治县',
          '景东彝族自治县',
          '思茅区',
          '澜沧拉祜族自治县',
          '江城哈尼族彝族自治县'
        ]
      },
      {
        'name': '昆明市',
        'children': [
          '西山区',
          '禄劝彝族苗族自治县',
          '石林彝族自治县',
          '盘龙区',
          '嵩明县',
          '富民县',
          '官渡区',
          '东川区',
          '宜良县',
          '晋宁县',
          '安宁市',
          '寻甸回族彝族自治县',
          '五华区',
          '呈贡区'
        ]
      },
      {
        'name': '保山市',
        'children': [
          '施甸县',
          '龙陵县',
          '腾冲县',
          '昌宁县',
          '隆阳区'
        ]
      },
      {
        'name': '楚雄彝族自治州',
        'children': [
          '元谋县',
          '武定县',
          '双柏县',
          '牟定县',
          '大姚县',
          '姚安县',
          '永仁县',
          '楚雄市',
          '禄丰县',
          '南华县'
        ]
      }
    ]
  },
  {
    'name': '湖南',
    'children': [
      {
        'name': '郴州市',
        'children': [
          '永兴县',
          '桂东县',
          '北湖区',
          '桂阳县',
          '安仁县',
          '苏仙区',
          '嘉禾县',
          '临武县',
          '宜章县',
          '汝城县',
          '资兴市'
        ]
      },
      {
        'name': '益阳市',
        'children': [
          '资阳区',
          '桃江县',
          '南县',
          '沅江市',
          '赫山区',
          '安化县'
        ]
      },
      {
        'name': '衡阳市',
        'children': [
          '雁峰区',
          '珠晖区',
          '衡阳县',
          '常宁市',
          '南岳区',
          '祁东县',
          '石鼓区',
          '衡南县',
          '耒阳市',
          '衡山县',
          '蒸湘区',
          '衡东县'
        ]
      },
      {
        'name': '怀化市',
        'children': [
          '新晃侗族自治县',
          '通道侗族自治县',
          '鹤城区',
          '溆浦县',
          '靖州苗族侗族自治县',
          '沅陵县',
          '麻阳苗族自治县',
          '辰溪县',
          '洪江市',
          '中方县',
          '会同县',
          '芷江侗族自治县'
        ]
      },
      {
        'name': '永州市',
        'children': [
          '新田县',
          '江华瑶族自治县',
          '冷水滩区',
          '双牌县',
          '零陵区',
          '蓝山县',
          '东安县',
          '宁远县',
          '祁阳县',
          '江永县',
          '道县'
        ]
      },
      {
        'name': '岳阳市',
        'children': [
          '平江县',
          '岳阳楼区',
          '云溪区',
          '岳阳县',
          '湘阴县',
          '临湘市',
          '君山区',
          '汨罗市',
          '华容县'
        ]
      },
      {
        'name': '常德市',
        'children': [
          '汉寿县',
          '鼎城区',
          '澧县',
          '武陵区',
          '桃源县',
          '石门县',
          '临澧县',
          '安乡县',
          '津市市'
        ]
      },
      {
        'name': '株洲市',
        'children': [
          '芦淞区',
          '天元区',
          '石峰区',
          '株洲县',
          '炎陵县',
          '攸县',
          '醴陵市',
          '茶陵县',
          '荷塘区'
        ]
      },
      {
        'name': '湘潭市',
        'children': [
          '岳塘区',
          '雨湖区',
          '韶山市',
          '湘乡市',
          '湘潭县'
        ]
      },
      {
        'name': '娄底市',
        'children': [
          '冷水江市',
          '涟源市',
          '娄星区',
          '双峰县',
          '新化县'
        ]
      },
      {
        'name': '邵阳市',
        'children': [
          '北塔区',
          '邵阳县',
          '双清区',
          '隆回县',
          '城步苗族自治县',
          '洞口县',
          '邵东县',
          '新邵县',
          '大祥区',
          '武冈市',
          '绥宁县',
          '新宁县'
        ]
      },
      {
        'name': '湘西土家族苗族自治州',
        'children': [
          '泸溪县',
          '花垣县',
          '龙山县',
          '永顺县',
          '吉首市',
          '凤凰县',
          '古丈县',
          '保靖县'
        ]
      },
      {
        'name': '张家界市',
        'children': [
          '永定区',
          '慈利县',
          '桑植县',
          '武陵源区'
        ]
      },
      {
        'name': '长沙市',
        'children': [
          '望城区',
          '长沙县',
          '天心区',
          '开福区',
          '岳麓区',
          '宁乡县',
          '芙蓉区',
          '浏阳市',
          '雨花区'
        ]
      }
    ]
  },
  {
    'name': '黑龙江',
    'children': [
      {
        'name': '大庆市',
        'children': [
          '杜尔伯特蒙古族自治县',
          '萨尔图区',
          '肇源县',
          '大同区',
          '红岗区',
          '肇州县',
          '让胡路区',
          '龙凤区',
          '林甸县'
        ]
      },
      {
        'name': '牡丹江市',
        'children': [
          '爱民区',
          '西安区',
          '穆棱市',
          '宁安市',
          '东宁县',
          '市辖区',
          '东安区',
          '林口县',
          '海林市',
          '阳明区'
        ]
      },
      {
        'name': '大兴安岭地区',
        'children': [
          '漠河县',
          '呼玛县',
          '塔河县'
        ]
      },
      {
        'name': '绥化市',
        'children': [
          '青冈县',
          '庆安县',
          '肇东市',
          '望奎县',
          '兰西县',
          '海伦市',
          '绥棱县',
          '安达市',
          '明水县',
          '北林区'
        ]
      },
      {
        'name': '齐齐哈尔市',
        'children': [
          '昂昂溪区',
          '龙沙区',
          '富裕县',
          '梅里斯达斡尔族区',
          '甘南县',
          '泰来县',
          '依安县',
          '建华区',
          '克山县',
          '龙江县',
          '富拉尔基区',
          '拜泉县',
          '克东县',
          '碾子山区',
          '铁锋区',
          '讷河市'
        ]
      },
      {
        'name': '七台河市',
        'children': [
          '新兴区',
          '茄子河区',
          '勃利县',
          '桃山区'
        ]
      },
      {
        'name': '哈尔滨市',
        'children': [
          '巴彦县',
          '松北区',
          '南岗区',
          '宾县',
          '尚志市',
          '呼兰区',
          '方正县',
          '五常市',
          '香坊区',
          '通河县',
          '平房区',
          '道里区',
          '木兰县',
          '依兰县',
          '延寿县',
          '阿城区',
          '道外区',
          '双城市'
        ]
      },
      {
        'name': '鹤岗市',
        'children': [
          '向阳区',
          '东山区',
          '工农区',
          '兴山区',
          '兴安区',
          '萝北县',
          '南山区',
          '绥滨县'
        ]
      },
      {
        'name': '黑河市',
        'children': [
          '嫩江县',
          '孙吴县',
          '北安市',
          '逊克县',
          '爱辉区',
          '五大连池市'
        ]
      },
      {
        'name': '鸡西市',
        'children': [
          '麻山区',
          '鸡冠区',
          '虎林市',
          '鸡东县',
          '恒山区',
          '滴道区',
          '密山市',
          '梨树区',
          '城子河区'
        ]
      },
      {
        'name': '绥芬河市'
      },
      {
        'name': '伊春市',
        'children': [
          '友好区',
          '乌马河区',
          '五营区',
          '铁力市',
          '上甘岭区',
          '新青区',
          '南岔区',
          '汤旺河区',
          '金山屯区',
          '美溪区',
          '乌伊岭区',
          '红星区',
          '伊春区',
          '嘉荫县',
          '带岭区',
          '翠峦区',
          '西林区'
        ]
      },
      {
        'name': '佳木斯市',
        'children': [
          '汤原县',
          '桦川县',
          '桦南县',
          '富锦市',
          '东风区',
          '前进区',
          '郊区',
          '向阳区',
          '同江市',
          '抚远县'
        ]
      },
      {
        'name': '双鸭山市',
        'children': [
          '友谊县',
          '尖山区',
          '岭东区',
          '饶河县',
          '集贤县',
          '宝山区',
          '四方台区',
          '宝清县'
        ]
      }
    ]
  },
  {
    'name': '宁夏',
    'children': [
      {
        'name': '银川市',
        'children': [
          '兴庆区',
          '永宁县',
          '金凤区',
          '灵武市',
          '西夏区',
          '贺兰县'
        ]
      },
      {
        'name': '固原市',
        'children': [
          '西吉县',
          '泾源县',
          '隆德县',
          '彭阳县',
          '原州区'
        ]
      },
      {
        'name': '石嘴山市',
        'children': [
          '惠农区',
          '大武口区',
          '平罗县'
        ]
      },
      {
        'name': '中卫市',
        'children': [
          '沙坡头区',
          '海原县',
          '中宁县'
        ]
      },
      {
        'name': '吴忠市',
        'children': [
          '同心县',
          '红寺堡区',
          '盐池县',
          '利通区',
          '青铜峡市'
        ]
      }
    ]
  },
  {
    'name': '山东',
    'children': [
      {
        'name': '枣庄市',
        'children': [
          '滕州市',
          '市中区',
          '山亭区',
          '峄城区',
          '薛城区',
          '台儿庄区'
        ]
      },
      {
        'name': '日照市',
        'children': [
          '五莲县',
          '东港区',
          '莒县',
          '岚山区'
        ]
      },
      {
        'name': '东营市',
        'children': [
          '垦利县',
          '河口区',
          '利津县',
          '广饶县',
          '东营区'
        ]
      },
      {
        'name': '烟台市',
        'children': [
          '芝罘区',
          '长岛县',
          '栖霞市',
          '莱州市',
          '招远市',
          '莱山区',
          '龙口市',
          '莱阳市',
          '蓬莱市',
          '海阳市',
          '福山区',
          '牟平区'
        ]
      },
      {
        'name': '菏泽市',
        'children': [
          '牡丹区',
          '单县',
          '东明县',
          '郓城县',
          '成武县',
          '定陶县',
          '鄄城县',
          '曹县',
          '巨野县'
        ]
      },
      {
        'name': '滨州市',
        'children': [
          '滨城区',
          '阳信县',
          '博兴县',
          '邹平县',
          '沾化县',
          '惠民县',
          '无棣县'
        ]
      },
      {
        'name': '济南市',
        'children': [
          '历下区',
          '历城区',
          '章丘市',
          '天桥区',
          '长清区',
          '槐荫区',
          '济阳县',
          '商河县',
          '市中区',
          '平阴县'
        ]
      },
      {
        'name': '莱芜市',
        'children': [
          '钢城区',
          '莱城区'
        ]
      },
      {
        'name': '聊城市',
        'children': [
          '莘县',
          '阳谷县',
          '东昌府区',
          '茌平县',
          '冠县',
          '临清市',
          '高唐县',
          '东阿县'
        ]
      },
      {
        'name': '临沂市',
        'children': [
          '平邑县',
          '苍山县',
          '郯城县',
          '费县',
          '河东区',
          '沂水县',
          '罗庄区',
          '临沭县',
          '莒南县',
          '兰山区',
          '沂南县',
          '蒙阴县'
        ]
      },
      {
        'name': '德州市',
        'children': [
          '夏津县',
          '武城县',
          '宁津县',
          '临邑县',
          '乐陵市',
          '禹城市',
          '陵县',
          '庆云县',
          '德城区',
          '平原县',
          '齐河县'
        ]
      },
      {
        'name': '淄博市',
        'children': [
          '淄川区',
          '张店区',
          '博山区',
          '高青县',
          '临淄区',
          '沂源县',
          '桓台县',
          '周村区'
        ]
      },
      {
        'name': '济宁市',
        'children': [
          '汶上县',
          '梁山县',
          '兖州市',
          '微山县',
          '邹城市',
          '曲阜市',
          '任城区',
          '市中区',
          '鱼台县',
          '泗水县',
          '嘉祥县',
          '金乡县'
        ]
      },
      {
        'name': '潍坊市',
        'children': [
          '安丘市',
          '潍城区',
          '奎文区',
          '昌邑市',
          '寒亭区',
          '诸城市',
          '高密市',
          '寿光市',
          '昌乐县',
          '青州市',
          '临朐县',
          '坊子区'
        ]
      },
      {
        'name': '威海市',
        'children': [
          '乳山市',
          '荣成市',
          '文登市',
          '环翠区'
        ]
      },
      {
        'name': '泰安市',
        'children': [
          '泰山区',
          '东平县',
          '肥城市',
          '岱岳区',
          '宁阳县',
          '新泰市'
        ]
      },
      {
        'name': '青岛市',
        'children': [
          '莱西市',
          '城阳区',
          '平度市',
          '李沧区',
          '崂山区',
          '市北区',
          '胶州市',
          '市南区',
          '黄岛区',
          '即墨市'
        ]
      }
    ]
  },
  {
    'name': '海南',
    'children': [
      {
        'name': '昌江黎族自治县'
      },
      {
        'name': '三亚市'
      },
      {
        'name': '白沙黎族自治县'
      },
      {
        'name': '临高县'
      },
      {
        'name': '文昌市'
      },
      {
        'name': '屯昌县'
      },
      {
        'name': '乐东黎族自治县'
      },
      {
        'name': '儋州市'
      },
      {
        'name': '三沙市',
        'children': [
          '西沙群岛',
          '南沙群岛',
          '中沙群岛的岛礁及其海域'
        ]
      },
      {
        'name': '万宁市'
      },
      {
        'name': '澄迈县'
      },
      {
        'name': '五指山市'
      },
      {
        'name': '海口市',
        'children': [
          '龙华区',
          '秀英区',
          '琼山区',
          '美兰区'
        ]
      },
      {
        'name': '东方市'
      },
      {
        'name': '陵水黎族自治县'
      },
      {
        'name': '定安县'
      },
      {
        'name': '琼海市'
      },
      {
        'name': '琼中黎族苗族自治县'
      },
      {
        'name': '保亭黎族苗族自治县'
      }
    ]
  },
  {
    'name': '广西',
    'children': [
      {
        'name': '梧州市',
        'children': [
          '万秀区',
          '龙圩区',
          '蒙山县',
          '长洲区',
          '苍梧县',
          '藤县',
          '岑溪市'
        ]
      },
      {
        'name': '贵港市',
        'children': [
          '平南县',
          '桂平市',
          '覃塘区',
          '港北区',
          '港南区'
        ]
      },
      {
        'name': '贺州市',
        'children': [
          '八步区',
          '钟山县',
          '昭平县',
          '富川瑶族自治县'
        ]
      },
      {
        'name': '百色市',
        'children': [
          '田林县',
          '乐业县',
          '隆林各族自治县',
          '田阳县',
          '右江区',
          '凌云县',
          '田东县',
          '平果县',
          '靖西县',
          '德保县',
          '那坡县',
          '西林县'
        ]
      },
      {
        'name': '南宁市',
        'children': [
          '上林县',
          '武鸣县',
          '横县',
          '江南区',
          '隆安县',
          '西乡塘区',
          '邕宁区',
          '青秀区',
          '良庆区',
          '马山县',
          '宾阳县',
          '兴宁区'
        ]
      },
      {
        'name': '北海市',
        'children': [
          '合浦县',
          '银海区',
          '铁山港区',
          '海城区'
        ]
      },
      {
        'name': '崇左市',
        'children': [
          '龙州县',
          '天等县',
          '大新县',
          '扶绥县',
          '凭祥市',
          '江州区',
          '宁明县'
        ]
      },
      {
        'name': '来宾市',
        'children': [
          '金秀瑶族自治县',
          '武宣县',
          '兴宾区',
          '合山市',
          '象州县',
          '忻城县'
        ]
      },
      {
        'name': '河池市',
        'children': [
          '凤山县',
          '宜州市',
          '东兰县',
          '环江毛南族自治县',
          '巴马瑶族自治县',
          '罗城仫佬族自治县',
          '天峨县',
          '南丹县',
          '大化瑶族自治县',
          '金城江区',
          '都安瑶族自治县'
        ]
      },
      {
        'name': '柳州市',
        'children': [
          '鱼峰区',
          '融水苗族自治县',
          '融安县',
          '柳江县',
          '柳北区',
          '三江侗族自治县',
          '柳城县',
          '鹿寨县',
          '城中区',
          '柳南区'
        ]
      },
      {
        'name': '桂林市',
        'children': [
          '平乐县',
          '七星区',
          '灵川县',
          '叠彩区',
          '永福县',
          '秀峰区',
          '资源县',
          '雁山区',
          '象山区',
          '灌阳县',
          '阳朔县',
          '龙胜各族自治县',
          '恭城瑶族自治县',
          '全州县',
          '荔浦县',
          '兴安县',
          '临桂区'
        ]
      },
      {
        'name': '防城港市',
        'children': [
          '防城区',
          '港口区',
          '上思县',
          '东兴市'
        ]
      },
      {
        'name': '钦州市',
        'children': [
          '钦北区',
          '浦北县',
          '钦南区',
          '灵山县'
        ]
      },
      {
        'name': '玉林市',
        'children': [
          '玉州区',
          '陆川县',
          '博白县',
          '容县',
          '北流市',
          '兴业县',
          '福绵区'
        ]
      }
    ]
  },
  {
    'name': '湖北',
    'children': [
      {
        'name': '咸宁市',
        'children': [
          '通城县',
          '通山县',
          '赤壁市',
          '崇阳县',
          '咸安区',
          '嘉鱼县'
        ]
      },
      {
        'name': '宜昌市',
        'children': [
          '宜都市',
          '五峰土家族自治县',
          '伍家岗区',
          '枝江市',
          '猇亭区',
          '秭归县',
          '远安县',
          '兴山县',
          '点军区',
          '夷陵区',
          '长阳土家族自治县',
          '西陵区',
          '当阳市'
        ]
      },
      {
        'name': '黄冈市',
        'children': [
          '麻城市',
          '红安县',
          '黄州区',
          '英山县',
          '武穴市',
          '浠水县',
          '蕲春县',
          '黄梅县',
          '团风县',
          '罗田县'
        ]
      },
      {
        'name': '潜江市'
      },
      {
        'name': '神农架林区'
      },
      {
        'name': '十堰市',
        'children': [
          '张湾区',
          '郧西县',
          '丹江口市',
          '竹溪县',
          '房县',
          '竹山县',
          '茅箭区',
          '郧县'
        ]
      },
      {
        'name': '随州市',
        'children': [
          '曾都区',
          '广水市',
          '随县'
        ]
      },
      {
        'name': '仙桃市'
      },
      {
        'name': '恩施土家族苗族自治州',
        'children': [
          '来凤县',
          '咸丰县',
          '利川市',
          '恩施市',
          '巴东县',
          '建始县',
          '鹤峰县',
          '宣恩县'
        ]
      },
      {
        'name': '襄阳市',
        'children': [
          '襄城区',
          '樊城区',
          '襄州区',
          '枣阳市',
          '宜城市',
          '保康县',
          '老河口市',
          '谷城县',
          '南漳县'
        ]
      },
      {
        'name': '武汉市',
        'children': [
          '东西湖区',
          '汉阳区',
          '洪山区',
          '江汉区',
          '硚口区',
          '蔡甸区',
          '黄陂区',
          '江夏区',
          '汉南区',
          '新洲区',
          '武昌区',
          '江岸区',
          '青山区'
        ]
      },
      {
        'name': '荆门市',
        'children': [
          '掇刀区',
          '京山县',
          '钟祥市',
          '东宝区',
          '沙洋县'
        ]
      },
      {
        'name': '荆州市',
        'children': [
          '江陵县',
          '荆州区',
          '石首市',
          '松滋市',
          '公安县',
          '沙市区',
          '洪湖市',
          '监利县'
        ]
      },
      {
        'name': '天门市'
      },
      {
        'name': '黄石市',
        'children': [
          '西塞山区',
          '铁山区',
          '阳新县',
          '黄石港区',
          '下陆区',
          '大冶市'
        ]
      },
      {
        'name': '鄂州市',
        'children': [
          '梁子湖区',
          '华容区',
          '鄂城区'
        ]
      },
      {
        'name': '孝感市',
        'children': [
          '孝南区',
          '孝昌县',
          '大悟县',
          '汉川市',
          '云梦县',
          '应城市',
          '安陆市'
        ]
      }
    ]
  },
  {
    'name': '西藏',
    'children': [
      {
        'name': '拉萨市',
        'children': [
          '当雄县',
          '曲水县',
          '达孜县',
          '林周县',
          '墨竹工卡县',
          '堆龙德庆县',
          '城关区',
          '尼木县'
        ]
      },
      {
        'name': '那曲地区',
        'children': [
          '巴青县',
          '申扎县',
          '那曲县',
          '索县',
          '双湖县',
          '尼玛县',
          '比如县',
          '聂荣县',
          '安多县',
          '班戈县',
          '嘉黎县'
        ]
      },
      {
        'name': '阿里地区',
        'children': [
          '改则县',
          '普兰县',
          '日土县',
          '札达县',
          '革吉县',
          '噶尔县',
          '措勤县'
        ]
      },
      {
        'name': '山南地区',
        'children': [
          '错那县',
          '措美县',
          '桑日县',
          '浪卡子县',
          '琼结县',
          '扎囊县',
          '加查县',
          '洛扎县',
          '贡嘎县',
          '乃东县',
          '曲松县',
          '隆子县'
        ]
      },
      {
        'name': '昌都地区',
        'children': [
          '左贡县',
          '察雅县',
          '芒康县',
          '八宿县',
          '洛隆县',
          '贡觉县',
          '江达县',
          '类乌齐县',
          '昌都县',
          '丁青县',
          '边坝县'
        ]
      },
      {
        'name': '林芝地区',
        'children': [
          '朗县',
          '林芝县',
          '墨脱县',
          '波密县',
          '察隅县',
          '工布江达县',
          '米林县'
        ]
      },
      {
        'name': '日喀则地区',
        'children': [
          '仲巴县',
          '昂仁县',
          '康马县',
          '岗巴县',
          '江孜县',
          '拉孜县',
          '亚东县',
          '萨迦县',
          '日喀则市',
          '仁布县',
          '定结县',
          '定日县',
          '萨嘎县',
          '吉隆县',
          '谢通门县',
          '南木林县',
          '白朗县',
          '聂拉木县'
        ]
      }
    ]
  },
  {
    'name': '辽宁',
    'children': [
      {
        'name': '铁岭市',
        'children': [
          '清河区',
          '铁岭县',
          '西丰县',
          '开原市',
          '银州区',
          '调兵山市',
          '昌图县'
        ]
      },
      {
        'name': '丹东市',
        'children': [
          '宽甸满族自治县',
          '元宝区',
          '东港市',
          '振安区',
          '振兴区',
          '凤城市'
        ]
      },
      {
        'name': '锦州市',
        'children': [
          '凌海市',
          '凌河区',
          '义县',
          '太和区',
          '古塔区',
          '北镇市',
          '黑山县'
        ]
      },
      {
        'name': '本溪市',
        'children': [
          '溪湖区',
          '明山区',
          '本溪满族自治县',
          '平山区',
          '南芬区',
          '桓仁满族自治县'
        ]
      },
      {
        'name': '盘锦市',
        'children': [
          '兴隆台区',
          '大洼县',
          '双台子区',
          '盘山县'
        ]
      },
      {
        'name': '辽阳市',
        'children': [
          '太子河区',
          '宏伟区',
          '白塔区',
          '灯塔市',
          '弓长岭区',
          '文圣区',
          '辽阳县'
        ]
      },
      {
        'name': '朝阳市',
        'children': [
          '龙城区',
          '北票市',
          '朝阳县',
          '喀喇沁左翼蒙古族自治县',
          '双塔区',
          '凌源市',
          '建平县'
        ]
      },
      {
        'name': '葫芦岛市',
        'children': [
          '兴城市',
          '绥中县',
          '连山区',
          '建昌县',
          '南票区',
          '龙港区'
        ]
      },
      {
        'name': '阜新市',
        'children': [
          '太平区',
          '彰武县',
          '清河门区',
          '海州区',
          '细河区',
          '新邱区',
          '阜新蒙古族自治县'
        ]
      },
      {
        'name': '沈阳市',
        'children': [
          '大东区',
          '辽中县',
          '铁西区',
          '东陵区',
          '皇姑区',
          '新民市',
          '沈北新区',
          '和平区',
          '沈河区',
          '于洪区',
          '苏家屯区',
          '康平县',
          '法库县'
        ]
      },
      {
        'name': '抚顺市',
        'children': [
          '新宾满族自治县',
          '顺城区',
          '新抚区',
          '抚顺县',
          '东洲区',
          '望花区',
          '清原满族自治县'
        ]
      },
      {
        'name': '鞍山市',
        'children': [
          '海城市',
          '铁西区',
          '立山区',
          '岫岩满族自治县',
          '千山区',
          '台安县',
          '铁东区'
        ]
      },
      {
        'name': '大连市',
        'children': [
          '西岗区',
          '沙河口区',
          '瓦房店市',
          '甘井子区',
          '金州区',
          '中山区',
          '庄河市',
          '普兰店市',
          '旅顺口区',
          '长海县'
        ]
      },
      {
        'name': '营口市',
        'children': [
          '站前区',
          '大石桥市',
          '鲅鱼圈区',
          '盖州市',
          '老边区',
          '西市区'
        ]
      }
    ]
  },
  {
    'name': '贵州',
    'children': [
      {
        'name': '黔东南苗族侗族自治州',
        'children': [
          '麻江县',
          '剑河县',
          '三穗县',
          '岑巩县',
          '黄平县',
          '施秉县',
          '凯里市',
          '雷山县',
          '天柱县',
          '从江县',
          '丹寨县',
          '锦屏县',
          '台江县',
          '黎平县',
          '镇远县',
          '榕江县'
        ]
      },
      {
        'name': '六盘水市',
        'children': [
          '水城县',
          '盘县',
          '六枝特区'
        ]
      },
      {
        'name': '安顺市',
        'children': [
          '平坝县',
          '普定县',
          '关岭布依族苗族自治县',
          '紫云苗族布依族自治县',
          '镇宁布依族苗族自治县',
          '西秀区'
        ]
      },
      {
        'name': '贵阳市',
        'children': [
          '息烽县',
          '观山湖区',
          '开阳县',
          '修文县',
          '云岩区',
          '乌当区',
          '花溪区',
          '南明区',
          '清镇市',
          '白云区'
        ]
      },
      {
        'name': '黔南布依族苗族自治州',
        'children': [
          '平塘县',
          '惠水县',
          '福泉市',
          '都匀市',
          '瓮安县',
          '三都水族自治县',
          '罗甸县',
          '荔波县',
          '长顺县',
          '龙里县',
          '贵定县',
          '独山县'
        ]
      },
      {
        'name': '黔西南布依族苗族自治州',
        'children': [
          '贞丰县',
          '安龙县',
          '晴隆县',
          '册亨县',
          '普安县',
          '望谟县',
          '兴义市',
          '兴仁县'
        ]
      },
      {
        'name': '遵义市',
        'children': [
          '绥阳县',
          '红花岗区',
          '桐梓县',
          '正安县',
          '道真仡佬族苗族自治县',
          '汇川区',
          '遵义县',
          '赤水市',
          '习水县',
          '仁怀市',
          '湄潭县',
          '凤冈县',
          '余庆县',
          '务川仡佬族苗族自治县'
        ]
      },
      {
        'name': '毕节市',
        'children': [
          '赫章县',
          '七星关区',
          '威宁彝族回族苗族自治县',
          '黔西县',
          '金沙县',
          '纳雍县',
          '大方县',
          '织金县'
        ]
      },
      {
        'name': '铜仁市',
        'children': [
          '玉屏侗族自治县',
          '石阡县',
          '思南县',
          '江口县',
          '碧江区',
          '松桃苗族自治县',
          '沿河土家族自治县',
          '德江县',
          '印江土家族苗族自治县',
          '万山区'
        ]
      }
    ]
  },
  {
    'name': '山西',
    'children': [
      {
        'name': '朔州市',
        'children': [
          '平鲁区',
          '怀仁县',
          '山阴县',
          '右玉县',
          '朔城区',
          '应县'
        ]
      },
      {
        'name': '阳泉市',
        'children': [
          '矿区',
          '盂县',
          '郊区',
          '城区',
          '平定县'
        ]
      },
      {
        'name': '晋城市',
        'children': [
          '沁水县',
          '阳城县',
          '陵川县',
          '城区',
          '泽州县',
          '高平市'
        ]
      },
      {
        'name': '临汾市',
        'children': [
          '浮山县',
          '尧都区',
          '安泽县',
          '乡宁县',
          '永和县',
          '霍州市',
          '大宁县',
          '汾西县',
          '洪洞县',
          '翼城县',
          '侯马市',
          '古县',
          '隰县',
          '蒲县',
          '襄汾县',
          '曲沃县',
          '吉县'
        ]
      },
      {
        'name': '忻州市',
        'children': [
          '宁武县',
          '偏关县',
          '河曲县',
          '繁峙县',
          '静乐县',
          '代县',
          '忻府区',
          '原平市',
          '定襄县',
          '保德县',
          '神池县',
          '五寨县',
          '五台县',
          '岢岚县'
        ]
      },
      {
        'name': '运城市',
        'children': [
          '平陆县',
          '永济市',
          '盐湖区',
          '稷山县',
          '万荣县',
          '夏县',
          '芮城县',
          '新绛县',
          '绛县',
          '河津市',
          '垣曲县',
          '闻喜县',
          '临猗县'
        ]
      },
      {
        'name': '长治市',
        'children': [
          '黎城县',
          '郊区',
          '襄垣县',
          '长子县',
          '长治县',
          '武乡县',
          '城区',
          '壶关县',
          '屯留县',
          '沁县',
          '平顺县',
          '潞城市',
          '沁源县'
        ]
      },
      {
        'name': '大同市',
        'children': [
          '大同县',
          '城区',
          '灵丘县',
          '左云县',
          '天镇县',
          '矿区',
          '南郊区',
          '浑源县',
          '阳高县',
          '新荣区',
          '广灵县'
        ]
      },
      {
        'name': '吕梁市',
        'children': [
          '汾阳市',
          '岚县',
          '临县',
          '文水县',
          '孝义市',
          '柳林县',
          '石楼县',
          '方山县',
          '交口县',
          '离石区',
          '兴县',
          '交城县',
          '中阳县'
        ]
      },
      {
        'name': '太原市',
        'children': [
          '古交市',
          '清徐县',
          '晋源区',
          '阳曲县',
          '万柏林区',
          '尖草坪区',
          '小店区',
          '迎泽区',
          '杏花岭区',
          '娄烦县'
        ]
      },
      {
        'name': '晋中市',
        'children': [
          '和顺县',
          '平遥县',
          '榆社县',
          '介休市',
          '太谷县',
          '灵石县',
          '寿阳县',
          '左权县',
          '祁县',
          '昔阳县',
          '榆次区'
        ]
      }
    ]
  },
  {
    'name': '甘肃',
    'children': [
      {
        'name': '张掖市',
        'children': [
          '临泽县',
          '民乐县',
          '山丹县',
          '甘州区',
          '高台县',
          '肃南裕固族自治县'
        ]
      },
      {
        'name': '兰州市',
        'children': [
          '皋兰县',
          '西固区',
          '永登县',
          '城关区',
          '榆中县',
          '安宁区',
          '红古区',
          '七里河区'
        ]
      },
      {
        'name': '平凉市',
        'children': [
          '崆峒区',
          '庄浪县',
          '灵台县',
          '泾川县',
          '崇信县',
          '华亭县',
          '静宁县'
        ]
      },
      {
        'name': '甘南藏族自治州',
        'children': [
          '夏河县',
          '玛曲县',
          '迭部县',
          '合作市',
          '临潭县',
          '卓尼县',
          '碌曲县',
          '舟曲县'
        ]
      },
      {
        'name': '临夏回族自治州',
        'children': [
          '广河县',
          '临夏市',
          '和政县',
          '临夏县',
          '永靖县',
          '东乡族自治县',
          '康乐县',
          '积石山保安族东乡族撒拉族自治县'
        ]
      },
      {
        'name': '白银市',
        'children': [
          '白银区',
          '景泰县',
          '靖远县',
          '会宁县',
          '平川区'
        ]
      },
      {
        'name': '定西市',
        'children': [
          '漳县',
          '渭源县',
          '安定区',
          '通渭县',
          '临洮县',
          '岷县',
          '陇西县'
        ]
      },
      {
        'name': '武威市',
        'children': [
          '民勤县',
          '凉州区',
          '古浪县',
          '天祝藏族自治县'
        ]
      },
      {
        'name': '金昌市',
        'children': [
          '永昌县',
          '金川区'
        ]
      },
      {
        'name': '天水市',
        'children': [
          '麦积区',
          '武山县',
          '张家川回族自治县',
          '清水县',
          '甘谷县',
          '秦州区',
          '秦安县'
        ]
      },
      {
        'name': '陇南市',
        'children': [
          '康县',
          '两当县',
          '成县',
          '西和县',
          '武都区',
          '宕昌县',
          '徽县',
          '礼县',
          '文县'
        ]
      },
      {
        'name': '嘉峪关市'
      },
      {
        'name': '酒泉市',
        'children': [
          '瓜州县',
          '肃北蒙古族自治县',
          '敦煌市',
          '肃州区',
          '金塔县',
          '玉门市',
          '阿克塞哈萨克族自治县'
        ]
      },
      {
        'name': '庆阳市',
        'children': [
          '华池县',
          '正宁县',
          '环县',
          '镇原县',
          '庆城县',
          '合水县',
          '宁县',
          '西峰区'
        ]
      }
    ]
  },
  {
    'name': '吉林',
    'children': [
      {
        'name': '吉林市',
        'children': [
          '龙潭区',
          '蛟河市',
          '磐石市',
          '舒兰市',
          '丰满区',
          '桦甸市',
          '永吉县',
          '昌邑区',
          '船营区'
        ]
      },
      {
        'name': '松原市',
        'children': [
          '前郭尔罗斯蒙古族自治县',
          '乾安县',
          '扶余市',
          '长岭县',
          '宁江区'
        ]
      },
      {
        'name': '白山市',
        'children': [
          '临江市',
          '长白朝鲜族自治县',
          '靖宇县',
          '浑江区',
          '抚松县',
          '江源区'
        ]
      },
      {
        'name': '长春市',
        'children': [
          '绿园区',
          '九台市',
          '农安县',
          '宽城区',
          '榆树市',
          '德惠市',
          '南关区',
          '朝阳区',
          '二道区',
          '双阳区'
        ]
      },
      {
        'name': '辽源市',
        'children': [
          '龙山区',
          '西安区',
          '东丰县',
          '东辽县'
        ]
      },
      {
        'name': '延边朝鲜族自治州',
        'children': [
          '龙井市',
          '延吉市',
          '珲春市',
          '敦化市',
          '汪清县',
          '安图县',
          '图们市',
          '和龙市'
        ]
      },
      {
        'name': '四平市',
        'children': [
          '双辽市',
          '铁西区',
          '公主岭市',
          '梨树县',
          '伊通满族自治县',
          '铁东区'
        ]
      },
      {
        'name': '白城市',
        'children': [
          '大安市',
          '洮南市',
          '洮北区',
          '通榆县',
          '镇赉县'
        ]
      },
      {
        'name': '通化市',
        'children': [
          '柳河县',
          '辉南县',
          '二道江区',
          '集安市',
          '梅河口市',
          '通化县',
          '东昌区'
        ]
      }
    ]
  },
  {
    'name': '四川',
    'children': [
      {
        'name': '南充市',
        'children': [
          '西充县',
          '蓬安县',
          '营山县',
          '顺庆区',
          '仪陇县',
          '阆中市',
          '高坪区',
          '嘉陵区',
          '南部县'
        ]
      },
      {
        'name': '内江市',
        'children': [
          '东兴区',
          '威远县',
          '隆昌县',
          '资中县',
          '市中区'
        ]
      },
      {
        'name': '雅安市',
        'children': [
          '汉源县',
          '石棉县',
          '宝兴县',
          '名山区',
          '芦山县',
          '荥经县',
          '雨城区',
          '天全县'
        ]
      },
      {
        'name': '绵阳市',
        'children': [
          '盐亭县',
          '涪城区',
          '北川羌族自治县',
          '江油市',
          '游仙区',
          '安县',
          '平武县',
          '三台县',
          '梓潼县'
        ]
      },
      {
        'name': '泸州市',
        'children': [
          '合江县',
          '纳溪区',
          '江阳区',
          '叙永县',
          '古蔺县',
          '龙马潭区',
          '泸县'
        ]
      },
      {
        'name': '宜宾市',
        'children': [
          '江安县',
          '筠连县',
          '高县',
          '屏山县',
          '宜宾县',
          '兴文县',
          '南溪区',
          '长宁县',
          '珙县',
          '翠屏区'
        ]
      },
      {
        'name': '凉山彝族自治州',
        'children': [
          '冕宁县',
          '普格县',
          '越西县',
          '会理县',
          '布拖县',
          '昭觉县',
          '金阳县',
          '木里藏族自治县',
          '美姑县',
          '德昌县',
          '甘洛县',
          '盐源县',
          '会东县',
          '宁南县',
          '西昌市',
          '喜德县',
          '雷波县'
        ]
      },
      {
        'name': '德阳市',
        'children': [
          '中江县',
          '罗江县',
          '绵竹市',
          '广汉市',
          '旌阳区',
          '什邡市'
        ]
      },
      {
        'name': '阿坝藏族羌族自治州',
        'children': [
          '理县',
          '松潘县',
          '若尔盖县',
          '壤塘县',
          '小金县',
          '黑水县',
          '金川县',
          '红原县',
          '阿坝县',
          '茂县',
          '马尔康县',
          '汶川县',
          '九寨沟县'
        ]
      },
      {
        'name': '甘孜藏族自治州',
        'children': [
          '丹巴县',
          '雅江县',
          '稻城县',
          '甘孜县',
          '九龙县',
          '色达县',
          '炉霍县',
          '新龙县',
          '泸定县',
          '石渠县',
          '理塘县',
          '德格县',
          '康定县',
          '白玉县',
          '道孚县',
          '得荣县',
          '乡城县',
          '巴塘县'
        ]
      },
      {
        'name': '遂宁市',
        'children': [
          '射洪县',
          '安居区',
          '船山区',
          '蓬溪县',
          '大英县'
        ]
      },
      {
        'name': '广安市',
        'children': [
          '邻水县',
          '武胜县',
          '前锋区',
          '岳池县',
          '广安区',
          '华蓥市'
        ]
      },
      {
        'name': '自贡市',
        'children': [
          '富顺县',
          '自流井区',
          '贡井区',
          '荣县',
          '沿滩区',
          '大安区'
        ]
      },
      {
        'name': '乐山市',
        'children': [
          '沙湾区',
          '夹江县',
          '金口河区',
          '井研县',
          '峨眉山市',
          '沐川县',
          '市中区',
          '犍为县',
          '马边彝族自治县',
          '五通桥区',
          '峨边彝族自治县'
        ]
      },
      {
        'name': '成都市',
        'children': [
          '蒲江县',
          '邛崃市',
          '新都区',
          '金堂县',
          '武侯区',
          '彭州市',
          '崇州市',
          '大邑县',
          '郫县',
          '金牛区',
          '龙泉驿区',
          '成华区',
          '青羊区',
          '锦江区',
          '双流县',
          '新津县',
          '青白江区',
          '都江堰市',
          '温江区'
        ]
      },
      {
        'name': '巴中市',
        'children': [
          '南江县',
          '平昌县',
          '恩阳区',
          '通江县'
        ]
      },
      {
        'name': '攀枝花市',
        'children': [
          '仁和区',
          '盐边县',
          '米易县',
          '西区'
        ]
      },
      {
        'name': '达州市',
        'children': [
          '达川区',
          '万源市',
          '开江县',
          '大竹县',
          '通川区',
          '渠县',
          '宣汉县'
        ]
      },
      {
        'name': '巴州区'
      },
      {
        'name': '眉山市',
        'children': [
          '东坡区',
          '彭山县',
          '丹棱县',
          '洪雅县',
          '仁寿县',
          '青神县'
        ]
      },
      {
        'name': '广元市',
        'children': [
          '利州区',
          '元坝区',
          '苍溪县',
          '剑阁县',
          '旺苍县',
          '朝天区',
          '青川县'
        ]
      },
      {
        'name': '资阳市',
        'children': [
          '雁江区',
          '简阳市',
          '安岳县',
          '乐至县'
        ]
      }
    ]
  },
  {
    'name': '广东',
    'children': [
      {
        'name': '潮州市',
        'children': [
          '湘桥区',
          '潮安区',
          '饶平县'
        ]
      },
      {
        'name': '湛江市',
        'children': [
          '廉江市',
          '吴川市',
          '徐闻县',
          '霞山区',
          '雷州市',
          '赤坎区',
          '坡头区',
          '遂溪县',
          '麻章区'
        ]
      },
      {
        'name': '河源市',
        'children': [
          '龙川县',
          '东源县',
          '连平县',
          '和平县',
          '紫金县'
        ]
      },
      {
        'name': '汕头市',
        'children': [
          '南澳县',
          '潮南区',
          '濠江区',
          '龙湖区',
          '澄海区',
          '金平区',
          '潮阳区'
        ]
      },
      {
        'name': '茂名市',
        'children': [
          '茂南区',
          '电白县',
          '化州市',
          '信宜市',
          '茂港区',
          '高州市'
        ]
      },
      {
        'name': '韶关市',
        'children': [
          '乳源瑶族自治县',
          '乐昌市',
          '仁化县',
          '新丰县',
          '始兴县',
          '武江区',
          '翁源县',
          '南雄市',
          '浈江区',
          '曲江区'
        ]
      },
      {
        'name': '深圳市',
        'children': [
          '盐田区',
          '宝安区',
          '龙岗区',
          '罗湖区',
          '南山区',
          '福田区'
        ]
      },
      {
        'name': '广州市',
        'children': [
          '南沙区',
          '越秀区',
          '白云区',
          '增城市',
          '番禺区',
          '海珠区',
          '荔湾区',
          '黄埔区',
          '花都区',
          '从化市',
          '萝岗区',
          '天河区'
        ]
      },
      {
        'name': '肇庆市',
        'children': [
          '怀集县',
          '广宁县',
          '鼎湖区',
          '四会市',
          '德庆县',
          '封开县',
          '端州区',
          '高要市'
        ]
      },
      {
        'name': '梅州市',
        'children': [
          '丰顺县',
          '平远县',
          '梅县',
          '蕉岭县',
          '兴宁市',
          '五华县',
          '大埔县',
          '梅江区'
        ]
      },
      {
        'name': '阳江市',
        'children': [
          '阳西县',
          '江城区',
          '阳春市',
          '阳东县'
        ]
      },
      {
        'name': '东莞市'
      },
      {
        'name': '云浮市',
        'children': [
          '云城区',
          '云安县',
          '新兴县',
          '罗定市',
          '郁南县'
        ]
      },
      {
        'name': '源城区'
      },
      {
        'name': '清远市',
        'children': [
          '连山壮族瑶族自治县',
          '清新区',
          '佛冈县',
          '英德市',
          '清城区',
          '连南瑶族自治县',
          '连州市',
          '阳山县'
        ]
      },
      {
        'name': '佛山市',
        'children': [
          '高明区',
          '顺德区',
          '三水区',
          '南海区',
          '禅城区'
        ]

      },
      {
        'name': '中山市',
        'children': [

        ]
      },
      {
        'name': '汕尾市',
        'children': [
          '陆丰市',
          '海丰县',
          '城区',
          '陆河县'
        ]
      },
      {
        'name': '珠海市',
        'children': [
          '香洲区',
          '金湾区',
          '斗门区'
        ]
      },
      {
        'name': '揭阳市',
        'children': [
          '榕城区',
          '惠来县',
          '揭东区',
          '揭西县',
          '普宁市'
        ]
      },
      {
        'name': '惠州市',
        'children': [
          '龙门县',
          '博罗县',
          '惠阳区',
          '惠东县',
          '惠城区'
        ]
      },
      {
        'name': '江门市',
        'children': [
          '台山市',
          '开平市',
          '新会区',
          '鹤山市',
          '江海区',
          '蓬江区',
          '恩平市'
        ]
      }
    ]
  },
  {
    'name': '新疆',
    'children': [
      {
        'name': '伊犁哈萨克自治州',
        'children': [
          '伊宁县',
          '奎屯市',
          '伊宁市',
          '特克斯县',
          '霍城县',
          '巩留县',
          '察布查尔锡伯自治县',
          '尼勒克县',
          '新源县',
          '昭苏县'
        ]
      },
      {
        'name': '塔城地区',
        'children': [
          '托里县',
          '塔城市',
          '沙湾县',
          '裕民县',
          '和布克赛尔蒙古自治县',
          '乌苏市',
          '额敏县'
        ]
      },
      {
        'name': '阿勒泰地区',
        'children': [
          '布尔津县',
          '阿勒泰市',
          '哈巴河县',
          '富蕴县',
          '福海县',
          '青河县',
          '吉木乃县'
        ]
      },
      {
        'name': '阿克苏地区',
        'children': [
          '乌什县',
          '库车县',
          '柯坪县',
          '阿克苏市',
          '沙雅县',
          '阿瓦提县',
          '温宿县',
          '拜城县',
          '新和县'
        ]
      },
      {
        'name': '石河子市'
      },
      {
        'name': '克孜勒苏柯尔克孜自治州',
        'children': [
          '阿图什市',
          '阿合奇县',
          '阿克陶县',
          '乌恰县'
        ]
      },
      {
        'name': '巴音郭楞蒙古自治州',
        'children': [
          '和硕县',
          '尉犁县',
          '且末县',
          '若羌县',
          '焉耆回族自治县',
          '博湖县',
          '和静县',
          '轮台县',
          '库尔勒市'
        ]
      },
      {
        'name': '吐鲁番地区',
        'children': [
          '吐鲁番市',
          '托克逊县',
          '鄯善县'
        ]
      },
      {
        'name': '和田地区',
        'children': [
          '策勒县',
          '洛浦县',
          '墨玉县',
          '于田县',
          '和田市',
          '皮山县',
          '和田县',
          '民丰县'
        ]
      },
      {
        'name': '克拉玛依市',
        'children': [
          '白碱滩区',
          '克拉玛依区',
          '独山子区',
          '乌尔禾区'
        ]
      },
      {
        'name': '乌鲁木齐市',
        'children': [
          '达坂城区',
          '水磨沟区',
          '天山区',
          '沙依巴克区',
          '头屯河区',
          '米东区',
          '新市区',
          '乌鲁木齐县'
        ]
      },
      {
        'name': '五家渠市'
      },
      {
        'name': '图木舒克市'
      },
      {
        'name': '昌吉回族自治州',
        'children': [
          '昌吉市',
          '奇台县',
          '呼图壁县',
          '玛纳斯县',
          '木垒哈萨克自治县',
          '阜康市',
          '吉木萨尔县'
        ]
      },
      {
        'name': '喀什地区',
        'children': [
          '塔什库尔干塔吉克自治县',
          '疏勒县',
          '叶城县',
          '伽师县',
          '岳普湖县',
          '英吉沙县',
          '疏附县',
          '麦盖提县',
          '莎车县',
          '泽普县',
          '喀什市',
          '巴楚县'
        ]
      },
      {
        'name': '哈密地区',
        'children': [
          '伊吾县',
          '哈密市',
          '巴里坤哈萨克自治县'
        ]
      },
      {
        'name': '博尔塔拉蒙古自治州',
        'children': [
          '温泉县',
          '阿拉山口市',
          '精河县',
          '博乐市'
        ]
      },
      {
        'name': '阿拉尔市'
      }
    ]
  },
  {
    'name': '香港',
    'children': [
      {
        'name': '香港',
        'children': [
          '北区',
          '湾仔',
          '西贡区',
          '黄大仙区',
          '观塘区',
          '屯门区',
          '沙田区',
          '屯门区',
          '南区',
          '大埔区',
          '九龙城区',
          '油尖旺区',
          '东区',
          '深水埗区',
          '中西区',
          '离岛区'
        ]
      }
    ]
  },
  {
    'name': '澳门',
    'children': [
      {
        'name': '澳门',
        'children': [
          '望德堂区',
          '顺丰堂区',
          '圣安多尼堂区',
          '大堂区',
          '氹仔',
          '路环岛',
          '花地玛堂区'
        ]
      }
    ]
  },
  {
    'name': '台湾',
    'children': [
      {
        'name': '高雄市',
        'children': [
          '鼓山区',
          '盐埕区',
          '小港区',
          '左营区',
          '新兴区',
          '旗津区',
          '前金区',
          '三民区',
          '芩雅区',
          '前镇区',
          '楠梓区'
        ]
      },
      {
        'name': '台南市',
        'children': [
          '中西区',
          '安南区',
          '安平区',
          '南区',
          '北区'
        ]
      },
      {
        'name': '基隆市',
        'children': [
          '中山区',
          '七堵区',
          '仁爱区',
          '暖暖区',
          '安乐区',
          '中正区',
          '信义区'
        ]
      },
      {
        'name': '彰化县'
      },
      {
        'name': '屏东县'
      },
      {
        'name': '宜兰县'
      },
      {
        'name': '台中市',
        'children': [
          '北屯区',
          '中区',
          '西区',
          '南屯区',
          '南区',
          '西屯区',
          '北区'
        ]
      },
      {
        'name': '新竹县'
      },
      {
        'name': '云林县'
      },
      {
        'name': '台北市',
        'children': [
          '士林区',
          '大安区',
          '中山区',
          '中正区',
          '北投区',
          '文山区',
          '内湖区',
          '松山区',
          '南港区',
          '信义区',
          '万华区',
          '大同区'
        ]
      },
      {
        'name': '新北市'
      },
      {
        'name': '花莲县'
      },
      {
        'name': '苗栗县'
      },
      {
        'name': '新竹市',
        'children': [
          '香山区',
          '北区'
        ]
      },
      {
        'name': '嘉义县'
      },
      {
        'name': '南投县'
      },
      {
        'name': '台东县'
      },
      {
        'name': '桃园县'
      },
      {
        'name': '嘉义市',
        'children': [
          '西区'
        ]
      },
      {
        'name': '金门县'
      },
      {
        'name': '澎湖县'
      }
    ]
  }
]
